//Напишите программу, которая на вход принимает число 
//и выдает его квадрат (число умноженное само на себя)

int a;

int b;

Console.Write("Enter number a = ");

a = Convert.ToInt32(Console.ReadLine ());

b = a*a;

Console.Write("Square of number a is b = ");

Console.Write(b);
